[
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Wood_Duck_%28Aix_sponsa%29%2C_Parc_du_Rouge-Clo%C3%AEtre%2C_Brussels.jpg/1280px-Wood_Duck_%28Aix_sponsa%29%2C_Parc_du_Rouge-Clo%C3%AEtre%2C_Brussels.jpg",
   "name": "Wood Duck",
   "description": "The wood duck is a medium-sized perching duck. A typical adult is from 47 to 54 cm (19 to 21 in) ( or 1.5 feet max.) In length with a wingspan of between 66 to 73 cm (26 to 29 in). The wood duck's weight ranges from 454-862 g (16.0-30.4 oz). This is about three-quarters of the length of an adult mallard. It shares its genus with the Asian Mandarin duck (Aix galericulata).\n\nThe adult male has stunning multicolored iridescent plumage and red eyes, with a distinctive white flare down the neck. The female, less colorful, has a white eye-ring and a whitish throat. Both adults have crested heads.\n\nThe male's call is a rising whistle, jeeeeee; the females utter a drawn-out, rising squeal, do weep do weep, when flushed, and a sharp cr-r-ek, cr-e-ek for an alarm call."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Common_eider_male_at_Jones_Beach_%2804702%29.jpg/1920px-Common_eider_male_at_Jones_Beach_%2804702%29.jpg",
   "name": "Common Eider",
   "description": "The common eider is both the largest of the four eider species and the largest duck found in Europe, and is exceeded in North America only by smatterings of the Muscovy duck, which only reaches North America in a wild state in southernmost Texas (and arguably south Florida where feral but non-native populations reside).\n\nIt measures 50 to 71 cm (19+1⁄2 to 28 in) in length, weighs 0.81 to 3.04 kg (1 lb 12+1⁄2 oz to 6 lb 11 oz) and spans 80–110 cm (31–43 in) across the wings. The average weight of 22 males in the North Atlantic was 2.21 kg (4 lb 14 oz) while 32 females weighed an average of 1.92 kg (4 lb 3+1⁄2 oz).\n\nIt is characterized by its bulky shape and large, wedge-shaped bill. The male is unmistakable, with its black and white plumage and green nape. The female is a brown bird, but can still be readily distinguished from all ducks, except other eider species, on the basis of size and head shape. The drake's display call is a strange almost human-like \"ah-ooo,\" while the hen utters hoarse quacks. The species is often readily approachable."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/8/8b/068_-_SCALED_QUAIL_%285-10-2015%29_las_cienegas_nca%2C_pima_co%2C_az_-17_%2816935159393%29.jpg",
   "name": "Scaled Quail",
   "description": "The scaled quail (Callipepla squamata), also commonly called blue quail or cottontop, is a species of the New World quail family. It is a bluish gray bird found in the arid regions of the Southwestern United States to Central Mexico. This species is an early offshoot of the genus Callipepla, diverging in the Pliocene.\n\nThis bird is named for the scaly appearance of its breast and back feathers. Along with its scaly markings, the bird is easily identified by its white crest that resembles a tuft of cotton.\n\nThe nest is typically a grass-lined hollow containing 9–16 speckled eggs. When disturbed, it prefers to run rather than fly.\n\nWidespread and common throughout its range, the scaled quail is evaluated as Least Concern on the IUCN Red List of Threatened Species."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Gall-dindi.jpg/800px-Gall-dindi.jpg",
   "name": "Wild Turkey",
   "description": "The wild turkey (Meleagris gallopavo) is an upland ground bird native to North America, one of two extant species of turkey, and the heaviest member of the order Galliformes. It is the ancestor to the domestic turkey, which was originally derived from a southern Mexican subspecies of wild turkey (not the related ocellated turkey). Although native to North America, the turkey probably got its name from the domesticated variety being imported to Britain in ships coming from the Levant via Spain. The British at the time therefore associated the wild turkey with the country Turkey and the name prevails. An alternative theory posits that another bird, a guinea fowl native to Madagascar introduced to England by Turkish merchants, was the original source, and that the term was then transferred to the New World bird by English colonizers with knowledge of the previous species."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/American_flamingo_%28Phoenicopterus_ruber%29.JPG/1280px-American_flamingo_%28Phoenicopterus_ruber%29.JPG",
   "name": "American Flamingo",
   "description": "The American flamingo is a large wading bird with reddish-pink plumage. Like all flamingos, it lays a single chalky-white egg on a mud mound, between May and August; incubation until hatching takes from 28 to 32 days; both parents brood the young for a period up to 6 years when they reach sexual maturity. Their life expectancy of 40 years is one of the longest in birds.\n\nAdult American flamingos are smaller on average than greater flamingos, but are the largest flamingos in the Americas. They measure from 120 to 145 cm (47 to 57 in) tall. The males weigh an average of 2.8 kg (6.2 lb), while females average 2.2 kg (4.9 lb). Most of its plumage is pink, giving rise to its earlier name of rosy flamingo and differentiating adults from the much paler greater flamingo. The wing coverts are red, and the primary and secondary flight feathers are black. The bill is pink and white with an extensive black tip. The legs are entirely pink. The call is a goose-like honking."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/a/a2/Clark%27s_grebe2.jpg",
   "name": "Clark's Grebe",
   "description": "Clark's grebe (Aechmophorus clarkii) is a North American waterbird species in the grebe family. Until the 1980s, it was thought to be a pale morph of the western grebe, which it resembles in size, range, and behavior. Intermediates between the two species are known.\n\nThis species nests on large inland lakes in western North America and migrates to the Pacific coast over the winter. It maintains local populations year-round in California, Nevada, and Arizona (the Lower Colorado River Valley), as well as in central Mexico. It feeds by diving for insects, polychaete worms, crustaceans, and salamanders."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/b/b7/Mourning_Dove_2006.jpg",
   "name": "Mourning Dove",
   "description": "The mourning dove (Zenaida macroura) is a member of the dove family, Columbidae. The bird is also known as the American mourning dove, the rain dove, and colloquially as the turtle dove, and was once known as the Carolina pigeon and Carolina turtledove. It is one of the most abundant and widespread of all North American birds and a popular gamebird, with more than 20 million birds (up to 70 million in some years) shot annually in the U.S., both for sport and meat. Its ability to sustain its population under such pressure is due to its prolific breeding; in warm areas, one pair may raise up to six broods of two young each in a single year. The wings make an unusual whistling sound upon take-off and landing, a form of sonation. The bird is a strong flier, capable of speeds up to 88 km/h (55 mph).\n\nMourning doves are light gray and brown and generally muted in color. Males and females are similar in appearance. The species is generally monogamous, with two squabs (young) per brood. Both parents incubate and care for the young. Mourning doves eat almost exclusively seeds, but the young are fed crop milk by their parents. It is the national bird of the British Virgin Islands."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Paloma_brav%C3%ADa_%28Columba_livia%29%2C_Palacio_de_Nymphenburg%2C_M%C3%BAnich%2C_Alemania01.JPG/800px-Paloma_brav%C3%ADa_%28Columba_livia%29%2C_Palacio_de_Nymphenburg%2C_M%C3%BAnich%2C_Alemania01.JPG",
   "name": "Rock Dove",
   "description": "The rock dove, rock pigeon, or common pigeon (Columba livia) is a member of the bird family Columbidae (doves and pigeons). In common usage, it is often simply referred to as the \"pigeon\".\n\nThe domestic pigeon (Columba livia domestica, which includes about 1,000 different breeds) descended from this species. Escaped domestic pigeons have increased the populations of feral pigeons around the world.\n\nWild rock doves are pale grey with two black bars on each wing, whereas domestic and feral pigeons vary in colour and pattern. Few differences are seen between males and females. The species is generally monogamous, with two squabs (young) per brood. Both parents care for the young for a time.\n\nHabitats include various open and semi-open environments. Cliffs and rock ledges are used for roosting and breeding in the wild. Originally found wild in Europe, North Africa, and western Asia, pigeons have become established in cities around the world. The species is abundant, with an estimated population of 17 to 28 million feral and wild birds in Europe alone and up to 120 million worldwide."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/1/14/Cuculus_canorus_vogelartinfo_chris_romeiks_CHR0791_cropped.jpg",
   "name": "Common Cuckoo",
   "description": "The common cuckoo (Cuculus canorus) is a member of the cuckoo order of birds, Cuculiformes, which includes the roadrunners, the anis and the coucals.\n\nThis species is a widespread summer migrant to Europe and Asia, and winters in Africa. It is a brood parasite, which means it lays eggs in the nests of other bird species, particularly of dunnocks, meadow pipits, and reed warblers. Although its eggs are larger than those of its hosts, the eggs in each type of host nest resemble the host's eggs. The adult too is a mimic, in its case of the sparrowhawk; since that species is a predator, the mimicry gives the female time to lay her eggs without being attacked."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Common_Nighthawk_%2814428313550%29.jpg",
   "name": "Common Nighthawk",
   "description": "The common nighthawk (Chordeiles minor) is a medium-sized crepuscular or nocturnal bird of the Americas within the nightjar family, whose presence and identity are best revealed by its vocalization. Typically dark (grey, black and brown), displaying cryptic colouration and intricate patterns, this bird is difficult to spot with the naked eye during the day. This bird is most conspicuous when in its buoyant and erratic flight. The most remarkable feature of this aerial insectivore is its small beak that belies the massiveness of its mouth. Some claim appearance similarities to owls. With its horizontal stance and short legs, the common nighthawk does not travel frequently on the ground, instead preferring to perch horizontally, parallel to branches, on posts, on the ground or on a roof. The males of this species may roost together but the bird is primarily solitary. The common nighthawk shows variability in territory size."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/USFWS_ribes_sanguineum_%2826123508822%29.jpg/1280px-USFWS_ribes_sanguineum_%2826123508822%29.jpg",
   "name": "Rufous Humingbird",
   "description": "The rufous hummingbird (Selasphorus rufus) is a small hummingbird, about 8 cm (3.1 in) long with a long, straight and slender bill. These birds are known for their extraordinary flight skills, flying 2,000 mi (3,200 km) during their migratory transits. It is one of seven species in the genus Selasphorus."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/5/5f/KingRail23.jpg",
   "name": "King Rail",
   "description": "Distinct features are a long bill with a slight downward curve, with adults being brown on the back and rusty-brown on the face and breast with a dark brown cap. They also have a white throat and a light belly with barred flanks. Immature birds are covered in down, with light brown on the head and darker brown on the back and wings.\n\nThis bird's call is a low repeated grunt transcribed as kek-kek-kek."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/b/b1/Larus_canus_Common_Gull_in_Norway.jpg",
   "name": "Common Gull",
   "description": "Adult common gulls are 40–46 cm (16–18 in) long, noticeably smaller than the herring gull and slightly smaller than the ring-billed gull. It is further distinguished from the ring-billed gull by its shorter, more tapered bill, which is a more greenish shade of yellow and is unmarked during the breeding season. The body is grey above and white below. The legs are yellow in breeding season, becoming duller in the winter. In winter, the head is streaked grey and the bill often has a poorly defined blackish band near the tip, which is sometimes sufficiently obvious to cause confusion with ring-billed gull. They have black wingtips with large white \"mirrors\" on the outer primaries p9 and p10, which are smaller than those in the short-billed gull. Young birds have scaly black-brown upperparts and a neat wing pattern, and pink legs which become greyish in the second year before tuning yellow. By the first winter, the head and belly are white, with fine streaks and greyish feathers grow on the saddle. They three years (up to four in the Kamchatka subspecies) to reach maturity. The call is a high-pitched \"laughing\" cry."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Yellow-billed_Loon_Chipp_South_8-12-13_Ryan_Askren.jpg/1280px-Yellow-billed_Loon_Chipp_South_8-12-13_Ryan_Askren.jpg",
   "name": "Yellow-billed Loon",
   "description": "The yellow-billed loon (Gavia adamsii), also known as the white-billed diver, is the largest member of the loon or diver family. Breeding adults have a black head, white underparts and chequered black-and-white mantle. Non-breeding plumage is drabber with the chin and foreneck white. The main distinguishing feature from great northern loon is the longer straw-yellow bill which, because the culmen is straight, appears slightly uptilted.\n\nIt breeds in the Arctic and winters mainly at sea along the coasts of the northern Pacific Ocean and northwestern Norway; it also sometimes overwinters on large inland lakes. It occasionally strays well south of its normal wintering range, and has been recorded as a vagrant in more than 22 countries. This species, like all divers, is a specialist fish-eater, catching its prey underwater. Its call is an eerie wailing, lower pitched than the common loon."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/American_White_Pelican.jpg/1280px-American_White_Pelican.jpg",
   "name": "American White Pelican",
   "description": "The American white pelican rivals the trumpeter swan, with a similar overall length, as the longest bird native to North America. Both very large and plump, it has an overall length of about 50–70 in (130–180 cm), courtesy of the huge beak which measures 11.3–15.2 in (290–390 mm) in males and 10.3–14.2 in (260–360 mm) in females. It has a wingspan of about 95–120 in (240–300 cm). The species also has the second largest average wingspan of any North American bird, after the California condor. This large wingspan allows the bird to easily use soaring flight for migration. Body weight can range between 7.7 and 30 lb (3.5 and 13.6 kg), although typically these birds average between 11 and 20 lb (5.0 and 9.1 kg)."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Great_egret_%28Ardea_alba%29_Tobago.jpg/1280px-Great_egret_%28Ardea_alba%29_Tobago.jpg",
   "name": "Great Egret",
   "description": "The great egret (Ardea alba), also known as the common egret, large egret, or (in the Old World) great white egret or great white heron is a large, widely distributed egret, with four subspecies found in Asia, Africa, the Americas, and southern Europe, recently also spreading to more northern areas of Europe. Distributed across most of the tropical and warmer temperate regions of the world, it builds tree nests in colonies close to water."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/About_to_Launch_%2826075320352%29.jpg/1280px-About_to_Launch_%2826075320352%29.jpg",
   "name": "Bald Eagle",
   "description": "The bald eagle (Haliaeetus leucocephalus) is a bird of prey found in North America. A sea eagle, it has two known subspecies and forms a species pair with the white-tailed eagle (Haliaeetus albicilla), which occupies the same niche as the bald eagle in the Palearctic. Its range includes most of Canada and Alaska, all of the contiguous United States, and northern Mexico. It is found near large bodies of open water with an abundant food supply and old-growth trees for nesting.\n\nThe bald eagle is an opportunistic feeder which subsists mainly on fish, which it swoops down and snatches from the water with its talons. It builds the largest nest of any North American bird and the largest tree nests ever recorded for any animal species, up to 4 m (13 ft) deep, 2.5 m (8.2 ft) wide, and 1 metric ton (1.1 short tons) in weight.\n\nBald eagles are not actually bald; the name derives from an older meaning of the word, \"white headed\". The adult is mainly brown with a white head and tail. The sexes are identical in plumage, but females are about 25 percent larger than males. The yellow beak is large and hooked. The plumage of the immature is brown."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/3/32/Red-tailed_Hawk.jpg",
   "name": "Red-tailed Hawk",
   "description": "The red-tailed hawk (Buteo jamaicensis) is a bird of prey that breeds throughout most of North America, from the interior of Alaska and northern Canada to as far south as Panama and the West Indies. It is one of the most common members within the genus of Buteo in North America or worldwide. The red-tailed hawk is one of three species colloquially known in the United States as the \"chickenhawk\", though it rarely preys on standard-sized chickens. The bird is sometimes also referred to as the red-tail for short, when the meaning is clear in context. Red-tailed hawks can acclimate to all the biomes within their range, occurring on the edges of non-ideal habitats such as dense forests and sandy deserts. The red-tailed hawk occupies a wide range of habitats and altitudes, including deserts, grasslands (from small meadows to the treed fringes of more extensive prairies), coniferous and deciduous forests, agricultural fields, and urban areas. Its latitudinal limits fall around the tree line in the subarctic and it is absent from the high Arctic. Generally it favors varied habitats with open woodland, woodland edge and open terrain. It is legally protected in Canada, Mexico, and the United States by the Migratory Bird Treaty Act."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Snowy_Owl_%28240866707%29.jpeg/1280px-Snowy_Owl_%28240866707%29.jpeg",
   "name": "Snowy Owl",
   "description": "The snowy owl (Bubo scandiacus), also known as the polar owl, the white owl and the Arctic owl, is a large, white owl of the true owl family. Snowy owls are native to the Arctic regions of both North America and the Palearctic, breeding mostly on the tundra. It has a number of unique adaptations to its habitat and lifestyle, which are quite distinct from other extant owls. One of the largest species of owl, it is the only owl with largely white plumage. Males tend to be a purer white overall while females tend to more have more extensive flecks of dark brown. Juvenile male snowy owls have dark markings that may appear similar to females until maturity, at which point they typically turn whiter. The composition of brown markings about the wing, although not foolproof, is the most reliable technique to age and sex individual snowy owls."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/9/92/%E2%99%82_Common_Kingfisher_%28Alcedo_atthis%29_Photograph_By_Shantanu_Kuveskar%2C_Mangaon%2C_Maharashtra%2C_India.jpg",
   "name": "Common Kingfisher",
   "description": "The common kingfisher (Alcedo atthis), also known as the Eurasian kingfisher and river kingfisher, is a small kingfisher with seven subspecies recognized within its wide distribution across Eurasia and North Africa. It is resident in much of its range, but migrates from areas where rivers freeze in winter.\n\nThis sparrow-sized bird has the typical short-tailed, large-headed kingfisher profile; it has blue upperparts, orange underparts and a long bill. It feeds mainly on fish, caught by diving, and has special visual adaptations to enable it to see prey under water. The glossy white eggs are laid in a nest at the end of a burrow in a riverbank."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Red-naped-sapsucker.jpg/800px-Red-naped-sapsucker.jpg",
   "name": "Red-naped Sapsucker",
   "description": "The red-naped sapsucker is a medium-sized woodpecker, measuring 19–21 cm (7.5–8.3 in) long and weighing 32–66 g (1.1–2.3 oz). Adults have a black head with a red forehead, white stripes, and a red spot on the nape; they have a white lower belly and rump. They have a yellow breast and upper belly. They are black on the back and wings with white bars; they have a large white wing patch. Adult males have a red throat patch; for females, the lower part of the throat is red, the upper part white."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/AmericanKestrel02.jpg/800px-AmericanKestrel02.jpg",
   "name": "American Kestrel",
   "description": "Under traditional classification, the American kestrel is the smallest raptor in America. The American kestrel is sexually dimorphic, although there is some overlap in plumage coloration between the sexes. The bird ranges from 22 to 31 cm (8.7 to 12.2 in) in length with a wingspan of 51–61 cm (20–24 in). The female kestrel is larger than the male, though less so than larger falcons, being typically about 10% to 15% larger within a subspecies. The more northern subspecies tend to larger sizes, with a large northern female being about twice the size of a small southern male. The male typically weighs 80–143 g (2.8–5.0 oz), and the female 86–165 g (3.0–5.8 oz). In standard measurements, the wing bone is 16–21 cm (6.3–8.3 in) long, the tail is 11–15 cm (4.3–5.9 in) and the tarsus is 3.2–4 cm (1.3–1.6 in)."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Turdus-migratorius-002.jpg/1280px-Turdus-migratorius-002.jpg",
   "name": "American Robin",
   "description": "The American robin (Turdus migratorius) is a migratory songbird of the true thrush genus and Turdidae, the wider thrush family. It is named after the European robin because of its reddish-orange breast, though the two species are not closely related, with the European robin belonging to the Old World flycatcher family. The American robin is widely distributed throughout North America, wintering from southern Canada to central Mexico and along the Pacific Coast. It is the state bird of Connecticut, Michigan, and Wisconsin."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/a/a0/Male_American_Goldfinch_in_Lodi_CA.JPG",
   "name": "American Goldfinch",
   "description": "The American goldfinch (Spinus tristis) is a small North American bird in the finch family. It is migratory, ranging from mid-Alberta to North Carolina during the breeding season, and from just south of the Canada–United States border to Mexico during the winter.\n\nThe only finch in its subfamily to undergo a complete molt, the American goldfinch displays sexual dichromatism: the male is a vibrant yellow in the summer and an olive color during the winter, while the female is a dull yellow-brown shade which brightens only slightly during the summer. The male displays brightly colored plumage during the breeding season to attract a mate."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/d/da/Cardinal.jpg",
   "name": "Northern Cardinal",
   "description": "The northern cardinal is a mid-sized songbird with a body length of 21–23 cm (8.3–9.1 in). It has a distinctive crest on the head and a mask on the face which is black in the male and gray in the female. The male is a vibrant red, while the female is a reddish olive color. The northern cardinal is mainly granivorous, but also feeds on insects and fruit. The male behaves territorially, marking out his territory with song. During courtship, the male feeds seed to the female beak-to-beak. A clutch of three to four eggs is laid, and two to four clutches are produced each year. It was once prized as a pet, but its sale as a cage bird was banned in the United States by the Migratory Bird Treaty Act of 1918."
 },
 {
   "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Blue_Jay-27527.jpg/1280px-Blue_Jay-27527.jpg",
   "name": "Blue Jay",
   "description": "The blue jay (Cyanocitta cristata) is a passerine bird in the family Corvidae, native to eastern North America. It lives in most of the eastern and central United States; some eastern populations may be migratory. Resident populations are also in Newfoundland, Canada; breeding populations are found across southern Canada. It breeds in both deciduous and coniferous forests, and is common in residential areas. Its coloration is predominantly blue, with a white chest and underparts, and a blue crest; it has a black, U-shaped collar around its neck and a black border behind the crest. Males and females are similar in size and plumage, and plumage does not vary throughout the year. Four subspecies have been recognized."
 }
]
